<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0577cfd961c442e4e8586c49b5546d516716572710fde9a72cef2261b8c281ee","plan_job_ref":"Job Create terraform plan #33 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6963533180","plan_hash":"53b45fe758579e5b84115befe4dc0584dd5ae650699f466585b32891fff76013","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/ad47ae029d0ec8cd6a37f3db3b26b4a87a813ed1ea7e0b1e6a5018c3a6a08d99.zip" -> "builds/e2713e6b06168ae503c1d91934e38ce70ed7a4be18f459a6676ca7db779eb58b.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-11-22T06:39:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:20" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:20/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "20" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "20" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/e2713e6b06168ae503c1d91934e38ce70ed7a4be18f459a6676ca7db779eb58b.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e2713e6b06168ae503c1d91934e38ce70ed7a4be18f459a6676ca7db779eb58b.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ad47ae029d0ec8cd6a37f3db3b26b4a87a813ed1ea7e0b1e6a5018c3a6a08d99.zip" -> "builds/e2713e6b06168ae503c1d91934e38ce70ed7a4be18f459a6676ca7db779eb58b.zip"
          ~ "timestamp" = "1700635166740734200" -> "1700694013030006000"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #33](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6963533180)